#### CreatePartList Method

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreatePartList(Document, ElementId) | Creates a new part list multicategory schedule assembly view for the assembly instance. |
| Public method Static member | CreatePartList(Document, ElementId, ElementId, Boolean) | Creates a new part list multicategory schedule assembly view for the assembly instance. |

# See Also

AssemblyViewUtils Class

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace